CarmelaDA/HomeArt_STM32/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *                             
  *---------------------------------- HOMEART ----------------------------------
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "ESP8266_HAL.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define WiFi_UART &huart2
#define PC_UART &huart6
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
ADC_HandleTypeDef hadc2;
ADC_HandleTypeDef hadc3;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;
TIM_HandleTypeDef htim5;
TIM_HandleTypeDef htim6;
TIM_HandleTypeDef htim8;
TIM_HandleTypeDef htim9;

UART_HandleTypeDef huart2;
UART_HandleTypeDef huart6;

/* USER CODE BEGIN PV */

volatile int timbre = 0;
volatile int stop = 0;
volatile int interior = 0;
volatile int exterior = 0;
volatile int fin = 0;

/*----------- Sensores -----------*/

// Sensor de Luminosidad (LDR)
uint16_t LDR_valor = 0;

// Higrómetro (HW-390)
uint16_t Higro_lectura = 0;
uint16_t Higro_real = 0;

// Sensor de Lluvia
uint16_t Lluvia_lectura = 0;
uint16_t Lluvia_real = 0;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_USART6_UART_Init(void);
static void MX_TIM5_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM4_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM8_Init(void);
static void MX_TIM9_Init(void);
static void MX_TIM6_Init(void);
static void MX_ADC1_Init(void);
static void MX_ADC2_Init(void);
static void MX_ADC3_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
    if (GPIO_Pin==B_Timbre_Pin)
	{
		timbre = 1;
	}
    if (GPIO_Pin==B_Stop_Pin)
    {
    	stop = 1;
    }
    if (GPIO_Pin==S_Int_Pin)
    {
        interior = 1;
    }
    if (GPIO_Pin==S_Ext_Pin)
    {
        exterior = 1;
    }
    if (GPIO_Pin==Fin_Servo_Pin)
    {
        fin = 1;
    }
}

int debouncer(volatile int* button_int, GPIO_TypeDef* GPIO_port, uint16_t GPIO_number) // Control de los rebotes
{
	static uint8_t button_count=0;
	static int counter=0;

	if (*button_int==1)
	{
		if (button_count==0)
		{
			counter=HAL_GetTick();
			button_count++;
		}
		if (HAL_GetTick()-counter>=20)
		{
			counter=HAL_GetTick();
			if (HAL_GPIO_ReadPin(GPIO_port, GPIO_number)!=1)
			{
				button_count=1;
			}
			else
			{
				button_count++;
			}
			if (button_count==4 ) // Periodo antirebotes
			{
				button_count=0;
				*button_int=0;
				return 1;
			}
		}
	}
	return 0;
}


void play_Timbre(void){

	uint8_t tone;

	tone = 20;
	__HAL_TIM_SET_AUTORELOAD(&htim4, tone*2);
	__HAL_TIM_SET_COMPARE(&htim4, TIM_CHANNEL_1, tone);
	HAL_Delay(300);

	tone = 40;
	__HAL_TIM_SET_AUTORELOAD(&htim4, tone*2);
	__HAL_TIM_SET_COMPARE(&htim4, TIM_CHANNEL_1, tone);
	HAL_Delay(800);

	__HAL_TIM_SET_COMPARE(&htim4, TIM_CHANNEL_1, 0);
}


void play_Alarma(){

	uint8_t tone;

	for(tone = 40; tone >= 10; tone = tone-10){
		__HAL_TIM_SET_AUTORELOAD(&htim4, tone*2);
		__HAL_TIM_SET_COMPARE(&htim4, TIM_CHANNEL_1, tone);
		HAL_Delay(300);
	}
}

void luces_automat(int i){

	if(i){
		//vIlum[23]='1';
		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_0, SET);
		//vIlum[24]='1';
		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_10, SET);
		//vIlum[25]='1';
		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_11, RESET);
	}
	else{
		//vIlum[23]='0';
		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_0, RESET);
		//vIlum[24]='0';
		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_10, RESET);
		//vIlum[25]='0';
		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_11, RESET);
	}
}


/*----------- Delay en Microsegundos -----------*/
void delay(uint16_t time){

	__HAL_TIM_SET_COUNTER(&htim6,0);
	while((__HAL_TIM_GET_COUNTER(&htim6))<time);
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART2_UART_Init();
  MX_USART6_UART_Init();
  MX_TIM5_Init();
  MX_TIM1_Init();
  MX_TIM4_Init();
  MX_TIM2_Init();
  MX_TIM3_Init();
  MX_TIM8_Init();
  MX_TIM9_Init();
  MX_TIM6_Init();
  MX_ADC1_Init();
  MX_ADC2_Init();
  MX_ADC3_Init();
  /* USER CODE BEGIN 2 */

  // LED RGB Gaming
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2);
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_3);
  // Servo Parcela
  HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
  // Servo Garaje
  HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_2);
  // Servo Tendedero
  HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_3);
  // Servo Salón
  HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_4);
  // Servo Dormitorio
  HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2);
  // Servo Oficina
  HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_3);
  // DC Salón
  HAL_TIM_PWM_Start(&htim9, TIM_CHANNEL_1);
  // Zumbador
  HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_1);

