CarmelaDA/HomeArt_STM32/Core/Src/main.c
  /*----------- Útil para Sensor DHT11/22 -----------*/
  HAL_TIM_Base_Start(&htim6);

  /*----------- Inicialización LDR & HW390 & Lluvia -----------*/
  HAL_ADC_Start(&hadc1); // LDR
  HAL_ADC_Start(&hadc2); // HW-390
  HAL_ADC_Start(&hadc3); // Lluvia

  //__HAL_UART_ENABLE_IT(&huart2, UART_IT_RXNE);
  ESP_Init("iPhone Carmela","pistacho");
  //ESP_Init("iPhone de Mario","11111111");
  //ESP_Init("MPIGDATA","B88458609A");

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1){
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */

	  	ESP_messageHandler();

		// TIMBRE
		if (debouncer(&timbre, B_Timbre_GPIO_Port, B_Timbre_Pin)){
			play_Timbre();
		}

		// STOP ALARMA
		// Conexión Wi-Fi

		// ALARMA
		if (debouncer(&interior, S_Int_GPIO_Port, S_Int_Pin)){
			if(vSeg[0] == '1') play_Alarma();
		}
		if (debouncer(&exterior, S_Ext_GPIO_Port, S_Ext_Pin)){
			if(vSeg[1] == '1') play_Alarma();
		}

		// PUERTA PARCELA (90)
		if(vVent[1]=='1' || vExt[4]=='1') __HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_1, 89);
		if(vVent[1]=='0' || vExt[4]=='0') __HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_1, 92);

		// PUERTA GARAJE (90)
		if(vVent[0]=='1') __HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_2, 89); // más rápido a 30
		if(vVent[0]=='0') __HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_2, 92);

		// TOLDO TENDEDERO (90)
		if(vExt[0]=='1') __HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_3, 89);
		if(vExt[0]=='0') __HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_3, 92);

		// VENTANA SALÓN (96)
		if(vVent[2]=='1') {
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_4, 95);
			HAL_Delay(3000);
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_4, 96);
		}
		if(vVent[2]=='0') {
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_4, 97);
			HAL_Delay(3000);
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_4, 96);
		}
		vVent[2]='x';

		// VENTANA DORMITORIO (171)
		if(vVent[3]=='1') {
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, 168);
			HAL_Delay(3000);
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, 170);
		}
		if(vVent[3]=='0') {
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, 172);

			HAL_Delay(3000);
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, 170);
		}
		vVent[3]='x';

		// VENTANA OFICINA
		if(vVent[4]=='1') {
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_3, 45);
			HAL_Delay(3000);
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_3, 135);
		}
		if(vVent[4]=='0') {
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_3, 100);
			HAL_Delay(3000);
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_3, 90);
		}
		vVent[4]='x';

		// FINALES DE CARRERA
		if(debouncer(&fin, Fin_Servo_GPIO_Port, Fin_Servo_Pin)){
			__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_1, 90); // S_Parcela
			__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_2, 90); // S_Garaje
			__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_3, 90); // S_Tendedero
			vVent[0]='x'; // S_Parcela
			vExt[4]='x'; // S_Parcela
			vVent[1]='x'; // S_Garaje
			vExt[0]='x'; // S_Tendedero
		}

		// VENTILADOR SALÓN
		if(vTemp[0]=='1') {
			__HAL_TIM_SET_COMPARE(&htim9, TIM_CHANNEL_1, 1000);
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_4,GPIO_PIN_SET);
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_5,GPIO_PIN_RESET);
		}
		if(vTemp[0]=='0') {
			__HAL_TIM_SET_COMPARE(&htim9, TIM_CHANNEL_1, 0);
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_4,GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_5,GPIO_PIN_RESET);
		}

		/*----------- Lectura Sensores -----------*/
		// LDR

		if(HAL_ADC_PollForConversion(&hadc1, HAL_MAX_DELAY) == HAL_OK)
			LDR_valor = HAL_ADC_GetValue(&hadc1);

		if(LDR_valor<90) {
			luces_automat(1);
			HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, 1);
		}
		else {
			luces_automat(0);
			HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, 0);
		}

		// HW-390

		if(HAL_ADC_PollForConversion(&hadc2, HAL_MAX_DELAY) == HAL_OK)
			Higro_lectura = HAL_ADC_GetValue(&hadc2);

		Higro_real = 100 - ((100*Higro_lectura)/255);

		// Lluvia

		if(HAL_ADC_PollForConversion(&hadc3, HAL_MAX_DELAY) == HAL_OK)
			Lluvia_lectura = HAL_ADC_GetValue(&hadc3);

		Lluvia_real = 100 - ((100*Lluvia_lectura)/255);
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 4;
  RCC_OscInitStruct.PLL.PLLN = 50;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief ADC1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_ADC1_Init(void)
{

  /* USER CODE BEGIN ADC1_Init 0 */

  /* USER CODE END ADC1_Init 0 */

  ADC_ChannelConfTypeDef sConfig = {0};

  /* USER CODE BEGIN ADC1_Init 1 */

  /* USER CODE END ADC1_Init 1 */
  /** Configure the global features of the ADC (Clock, Resolution, Data Alignment and number of conversion)
  */
  hadc1.Instance = ADC1;
  hadc1.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV2;
  hadc1.Init.Resolution = ADC_RESOLUTION_8B;
  hadc1.Init.ScanConvMode = ENABLE;
  hadc1.Init.ContinuousConvMode = ENABLE;
  hadc1.Init.DiscontinuousConvMode = DISABLE;
  hadc1.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
  hadc1.Init.ExternalTrigConv = ADC_SOFTWARE_START;
  hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
  hadc1.Init.NbrOfConversion = 1;
  hadc1.Init.DMAContinuousRequests = DISABLE;
  hadc1.Init.EOCSelection = ADC_EOC_SEQ_CONV;
  if (HAL_ADC_Init(&hadc1) != HAL_OK)
  {
    Error_Handler();
  }
  /** Configure for the selected ADC regular channel its corresponding rank in the sequencer and its sample time.
  */
  sConfig.Channel = ADC_CHANNEL_4;
  sConfig.Rank = 1;
  sConfig.SamplingTime = ADC_SAMPLETIME_480CYCLES;
  if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN ADC1_Init 2 */

  /* USER CODE END ADC1_Init 2 */

